Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: See also: mysql_query(), mysql_num_rows().
es: ?php $link = mysql_pconnect ("kron", "jutta", "geheim") {or die ("Could not connect");} mysql_select_db ("samp_db") {or die ("Could not select database");} $query = "SELECT last_name, first_name FROM friends"; $result = mysql_query ($query) {or die ("Query failed");} # fetch rows in reverse order for ($i = mysql_num_rows ($result) - 1; $i =0; $i- -) {if (!mysql_data_seek ($result, $i)) {printf ("Cannot seek to row %d\n", $i); continue;} if( !($row = mysql_fetch_object ($result))) continue; printf ("%s %s BR \n", $row - last_name, $row - first_name);} mysql_free_result ($result);?

source: Example 1. mysql_db_name() example
es: Ejemplo 1. mysql_db_name() example

source: Returns a positive MySQL result resource to the query result, or FALSE on error.
es: Devuelve:

source: mysql_db_query() selects a database and executes a query on it.
es: Un identificador de resultado positivo o falso si error.

source: Be aware that this function does NOT switch back to the database you were connected before.
es: mysql_db_query() selecciona una base y ejecuta una sentencia en ella.

source: Users are strongly encouraged to use the database.table syntax in their sql queries instead of this function.
es: Si el identificador de enlace no ha sido especificado, la función intenta encontrar un enlace abierto al servidor MySQL y si no lo encuentra, intetará crear uno como si fuera llamado mysql_connect() sin argumentos

source: This function has been deprecated since PHP 4.0.6.
es: Ver también mysql_connect().

source: Use mysql_select_db() and mysql_query() instead.
es: Por razones de compatibilidad puede usarse mysql() igualmente.

source: mysql_drop_db() attempts to drop (remove) an entire database from the server associated with the specified link identifier.
es: Devuelve: verdadero si éxito, falso si error.

source: This is deprecated, however.
es: mysql_drop_db() intenta suprimir una base de datos completa del servidor asociado al identificador de enlace.

source: The function mysql_drop_db() is deprecated.
es: Ver también: mysql_create_db().

source: See also: mysql_create_db(), mysql_query().
es: Por razones de compatibilidad puede usarse mysql_dropdb() igualmente.

source: Instead, use mysql_errno() to retrieve the error code.
es: Los errores devueltos por mySQL no indican los warnings.

source: Example 1. mysql_errno Example
es: Usar estas funciones para encontrar el número de error.

source: The above example would produce the following output:
es: ?php mysql_connect( "marliesle"); echo mysql_errno() .": ".mysql_error(). "BR"; mysql_select_db("nonexistentdb"); echo mysql_errno() .": ".mysql_error(). "BR"; $conn = mysql_query("SELECT * FROM nonexistenttable"); echo mysql_errno() .": ".mysql_error(). "BR";?

source: If not, the last opened link is used.
es: Ver también: mysql_error()

source: Instead, use mysql_error() to retrieve the error text.
es: Los errores devueltos por mySQL no indican los warnings.

source: Example 1. mysql_error Example
es: Usar estas funciones para encontrar el número de error.

source: Example 1. mysql_escape_string() example
es: Ejemplo 1. mysql_escape_string() example

source: mysql_fetch_array() is an extended version of mysql_fetch_row().
es: Devuelve una matriz que corresponde a la sentencia extraida, o falso si no quedan más filas.

source: To access the other column( s) of the same name, you must use the numeric index of the column or make an alias for the column.
es: Además de guardar los datos en el indice numerico de la matriz, guarda también los datos en los indices asociativos, usando el nombre de campo como clave.

source: select table1.field as foo table2.field as bar from table1, table2
es: Para acceder a la( s) otra(s) columna(s) con el mismo nombre, se debe escificar el indice numerico o definir un alias para la columna.

source: An important thing to note is that using mysql_fetch_array() is not significantly slower than using mysql_fetch_row(), while it provides a significant added value.
es: select t1.f1 as foo t2.f1 as bar from t1, t2

source: MYSQL_ASSOC, MYSQL_NUM, and MYSQL_BOTH.
es: La función mysql_fetch_array() no es significativemente mas lenta que mysql_fetch_row(), sin embargo tiene un valor añadido importante.

source: By using MYSQL_BOTH, you 'll get an array with both associative and number indices.
es: El segundo argumento opcional tipo_de_resultado en mysql_fetch_array() es una constante y puede tomar los valores siguientes:

source: Example 2. mysql_fetch_array with MYSQL_NUM
es: MYSQL_ASSOC, MYSQL_NUM, y MYSQL_BOTH. (Esta funcionalidad fue añadida en PHP 3.0.7)

source: Example 3. mysql_fetch_array with MYSQL_ASSOC
es: Para más detalles, ver también mysql_fetch_row().

source: Example 4. mysql_fetch_array with MYSQL_BOTH
es: Ejemplo 1. mysql fetch array

source: For further details, see also mysql_fetch_row() and mysql_fetch_assoc().
es: ?php mysql_connect( $host,$user,$password); $result = mysql_db_query("database" ,"select * from table"); while($row = mysql_fetch_array($result)) {echo $row["user_id"]; echo $row["fullname"];} mysql_free_result($result);?

source: mysql_fetch_field() can be used in order to obtain information about fields in a certain query result.
es: Puede usarse mysql_fetch_field() Puede usarse mysql_fetch_field() para obtener información sobre campos en un resultado.

source: If the field offset isn' t specified, the next field that wasn't yet retrieved by mysql_fetch_field() is retrieved.
es: Si no se especifica el salto, se extrae el siguiente campo que todavia no ha sido extraido. con mysql_fetch_field().

source: unique_key - 1 if the column is a unique key
es: unique_key - 1 si la columna es clave unica

source: multiple_key - 1 if the column is a non-unique key
es: multiple_key - 1 si la columna es clave no unica

source: blob - 1 if the column is a BLOB
es: blob - 1 si la columna es un BLOB

source: unsigned - 1 if the column is unsigned
es: unsigned - 1 si la columna es unsigned

source: Example 1. mysql_fetch_field()
es: zerofill - 1 si la columna es zero-filled

source: See also mysql_field_seek().
es: Ver también mysql_field_seek()

source: Returns an array that corresponds to the lengths of each field in the last row fetched by mysql_fetch_row(), or FALSE on error.
es: Una matriz que contiene las longitudes de cada campo de la última fila extraida por mysql_fetch_row(), o falso si error.

source: mysql_fetch_lengths() stores the lengths of each result column in the last row returned by mysql_fetch_row(), mysql_fetch_array(), and mysql_fetch_object() in an array, starting at offset 0.
es: mysql_fetch_lengths() almacena las longitudes de cada columna en la última fila devuelta por mysql_fetch_row(), mysql_fetch_array(), y mysql_fetch_object() en una matriz, empezando por 0.

source: See also: mysql_fetch_row().
es: Ver también: mysql_fetch_row().

source: mysql_fetch_object() is similar to mysql_fetch_array(), with one difference - an object is returned, instead of an array.
es: mysql_fetch_object() es similar a mysql_fetch_array(), con la diferencia que un objeto es devuelto en lugar de una matriz.

source: ?php / * this is valid * / echo $row - field; / * this is invalid * / echo $row - 0;?
es: El argumento opcional tipo_de_resultado es una constante y puede tomar los valores siguientes:

source: Speed-wise, the function is identical to mysql_fetch_array(), and almost as quick as mysql_fetch_row() (the difference is insignificant).
es: La función es identica a mysql_fetch_array(), y casi tan rápida como mysql_fetch_row() (la diferencia es insignificante).

source: Example 1. mysql_fetch_object() example
es: Ejemplo 1. mysql fetch object

source: ?php mysql_connect( "hostname", "user", "password"); mysql_select_db($db); $result = mysql_query("select * from table"); while ($row = mysql_fetch_object($result)) {echo $row - user_id; echo $row - fullname;} mysql_free_result($result);?
es: ?php mysql_connect( $host,$user,$password); $result = mysql_db_query("database" ,"select * from table"); while($row = mysql_fetch_object($result)) {echo $row - user_id; echo $row - fullname;} mysql_free_result($result);?

source: See also: mysql_fetch_array() and mysql_fetch_row().
es: Ver también: mysql_fetch_array() y mysql_fetch_row().

source: mysql_fetch_row() fetches one row of data from the result associated with the specified result identifier.
es: mysql_fetch_row() seleciona una fila de datos del resultado asociado al identificador de resultado especificado.

source: Subsequent call to mysql_fetch_row() would return the next row in the result set, or FALSE if there are no more rows.
es: La llamada a mysql_fetch_row() debería devolver la próxima fila del resultado, o falso si no quedan más filas.

source: See also: mysql_fetch_array(), mysql_fetch_object(), mysql_data_seek(), mysql_fetch_lengths(), and mysql_result().
es: Ver también: mysql_fetch_array(), mysql_fetch_object(), mysql_data_seek(), mysql_fetch_lengths(), and mysql_result().

source: mysql_field_flags() returns the field flags of the specified field.
es: mysql_field_flags() devuelve los flags del campo especificado.

source: The flags are reported as a single word per flag separated by a single space, so that you can split the returned value using explode().
es: Cada flag es devuelto como una palabra y estan separados un unico espacio, se puede dividir el resultado devuelto utilizando explode().

source: The following flags are reported, if your version of MySQL is current enough to support them: "not_null", "primary_key", "unique_key", "multiple_key", "blob", "unsigned", "zerofill", "binary", "enum", "auto_increment", "timestamp".
es: Los siguientes flags pueden ser devueltos si tu versión de MySQL los soporta: "not_null", "primary_key", "unique_key", "multiple_key", "blob", "unsigned", "zerofill", "binary", "enum", "auto_increment", "timestamp".

source: mysql_field_len() returns the length of the specified field.
es: mysql_field_len() devuelve la longitud del campo especificado.

source: mysql_field_name() returns the name of the specified field index. result must be a valid result identifier and field_index is the numerical offset of the field.
es: mysql_field_name() devuelve el nombre del campo especificado.

source: The index of the third field would actually be 2, the index of the fourth field would be 3 and so on.
es: Los argumentos de la función son el identificador de resultado y el indice del campo.

source: /* The users table consists of three fields: * user_id * username * password. * / $link = mysql_connect( 'localhost', "mysql_user", "mysql_password"); mysql_select_db($dbname, $link) or die("Could not set $dbname: ". mysql_error()); $res = mysql_query("select * from users", $link); echo mysql_field_name($res, 0). "\n"; echo mysql_field_name($res, 2);
es: Por ejemplo: mysql_field_name( $result,2);

source: user_id password
es: Devolverá el nombre del segundo campo asociado al identificador de resultado.

source: If the next call to mysql_fetch_field() doesn't include a field offset, the field offset specified in mysql_field_seek() will be returned.
es: Si la próxima llamada a mysql_fetch_field() no incluye un offset de campo, se devolverá ese campo.

source: See also: mysql_fetch_field().
es: Ver también: mysql_fetch_field().

source: Returns the name of the table that the specifed field is in.
es: Devuelve el nombre de la tabla del campo.

source: mysql_field_type() is similar to the mysql_field_name() function.
es: mysql_field_type() es similar a la función mysql_field_name().

source: The arguments are identical, but the field type is returned instead.
es: Los argumentos son identicos, pero se devuelve el tipo de campo.

source: The field type will be one of "int", "real", "string", "blob", and others as detailed in the MySQL documentation.
es: El tipo sera "int", "real", "string", "blob", o otros detallados en la documentación de MySQL.

source: MySQL field types
es: Ejemplo 1. mysql field types

source: For downward compatibility mysql_fieldtype() can also be used.
es: Por razones de compatibilidad puede usarse tambien mysql_fieldtype().

source: mysql_free_result() only needs to be called if you are concerned about how much memory is being used for queries that return large result sets.
es: mysql_free_result() solo necesita ser llamada si te preocupa usar demasiado memoria durante la ejecución de tu script.

source: Example 1. mysql_get_client_info Example
es: Ejemplo 1. mysql_get_client_info Example

source: Example 1. mysql_get_host_info Example
es: Ejemplo 1. mysql_get_host_info Example

source: Example 1. mysql_get_proto_info Example
es: Ejemplo 1. mysql_get_proto_info Example

source: Example 1. mysql_get_server_info Example
es: Ejemplo 1. mysql_get_server_info Example

source: If you need to save the value for later, be sure to call mysql_insert_id() immediately after the query that generates the value.
es: mysql_insert_id() devuelve el identificador generado para un campo de tipo AUTO_INCREMENTED.

source: If your AUTO_INCREMENT column has a column type of BIGINT, the value returned by mysql_insert_id() will be incorrect.
es: Si no se especifica el identificador_de_enlace, se asume por defecto el último enlace abierto.

source: Example 1. mysql_list_dbs() example
es: mysql_list_dbs() devuelve un puntero de resultado que contiene las bases disponibles en el actual demonio mysql.

source: For downward compatibility mysql_listdbs() can also be used.
es: Por razones de compatibilidad puede usarse tambien mysql_listdbs().

source: mysql_list_fields() retrieves information about the given table name.
es: mysql_list_fields() lista información sobre la tabla.

source: A result pointer is returned which can be used with mysql_field_flags(), mysql_field_len(), mysql_field_name(), and mysql_field_type().
es: Se devuelve un puntero que puede ser usado por las funciónes mysql_field_flags(), mysql_field_len(), mysql_field_name(), y mysql_field_type().

source: Example 1. mysql_list_fields() example
es: Un identificador de resultado es un entero positivo.

source: For downward compatibility mysql_listfields() can also be used.
es: Por razones de compatibilidad puede usarse tambien mysql_listfields().

source: Example 1. mysql_list_processes() example
es: Ejemplo 1. mysql_list_processes() example

source: The database parameter is the name of the database to retrieve the list of tables from.
es: mysql_list_tables() toma el nombre de la base y devuelve un puntero de resultado como la función mysql_db_query().

source: For downward compatibility, the function alias named mysql_listtables() can be used.
es: La función mysql_tablename() debe ser usada para extraer los nombres de las tablas del puntero.

source: Example 1. mysql_list_tables Example
es: Por razones de compatibilidad puede usarse tambien mysql_listtables(). can also be used.

source: mysql_num_fields() returns the number of fields in a result set.
es: mysql_num_fields() devuelve el numero de campos de un identificador de resultado.

source: See also: mysql_select_db(), mysql_query(), mysql_fetch_field(), mysql_num_rows().
es: Ver también: mysql_db_query(), mysql_query(), mysql_fetch_field(), mysql_num_rows().

source: This is deprecated however.
es: Por razones de compatibilidad puede usarse tambien mysql_numfields().

source: Example 1. mysql_num_rows() example
es: mysql_num_rows() Devuelve el numero de filas de un identificador de resultado.

source: If you use mysql_unbuffered_query(), mysql_num_rows() will not return the correct value until all the rows in the result set have been retrieved.
es: Ver también: mysql_db_query(), mysql_query() and, mysql_fetch_row().

source: For downward compatibility mysql_numrows() can also be used.
es: Por razones de compatibilidad puede usarse tambien mysql_numrows().

source: Returns a positive MySQL persistent link identifier on success, or FALSE on error.
es: Devuelve: un identificador de enlace persistente, o falso si se produce un error.

source: mysql_pconnect() establishes a connection to a MySQL server.
es: mysql_pconnect() establece una conexión a un servidor MySQL.

source: The server parameter can also include a port number. eg. "hostname:port" or a path to a socket eg. ": / path / to / socket" for the localhost.
es: El hostname puede incluir un numero de puerto. ej. "hostname:port" o un camino al socket ej. ": / camino / al / socket" para el puerto para el host local.

source: Support for the ": / path / to / socket" was added in 3.0.10.
es: Soporte para ":puerto" fue añadido en 3.0B4.

source: mysql_pconnect() acts very much like mysql_connect() with two major differences.
es: Soporte para ": / camino / al / socket" fue añadido en 3.0.10.

source: The optional client_flags parameter became available in PHP 4.3.0.
es: Si lo encuentra, devuelve el identificador de enlace en lugar de abrir otra conexión.

source: See the Persistent Database Connections section for more information.
es: El enlace permanecera abierta para ser usado en el futuro (mysql_close() will not cierra el enlace establecido con mysql_pconnect()).

source: Using persistent connections can require a bit of tuning of your Apache and MySQL configurations to ensure that you do not exceed the number of connections allowed by MySQL.
es: Este tipo de enlaces son llamados 'persistentes'.

source: If link_identifier isn 't specified, the last opened link is assumed.
es: mysql_query() envia una sentencia a la base activa en el servidor asociado al identificador de enlace.

source: If no link is open, the function tries to establish a link as if mysql_connect() was called with no arguments, and use it.
es: Si no es especificado un identificador_de_enlace, se asumira el ultilmo enlace abierto.

source: It defaults to MYSQL_STORE_RESULT, so the result is buffered.
es: Si no hay ningun enlace abierto, la función intenta estalecer un enlace como si se llamara función mysql_connect() sin argumentos, y lo utiliza.

source: Only for SELECT,SHOW,EXPLAIN or DESCRIBE statements mysql_query() returns a resource identifier or FALSE if the query was not executed correctly.
es: mysql_query() devuelve TRUE (no-cero) o FALSE para indicar si la sentencia se ha ejecutado correctamente o no.

source: For other type of SQL statements, mysql_query() returns TRUE on success and FALSE on error.
es: Un valor TRUE significa que la sentencia era correcta y pudo ser ejecutada en el servidor.

source: A non - FALSE return value means that the query was legal and could be executed by the server.
es: No indica nada sobre el numero de fila devueltas.

source: It is perfectly possible for a query to succeed but affect no rows or return no rows.
es: Es perfectamente posible que la sentencia se ejecute correctamente pero que no devuelve ninguna fila.

source: The following query is syntactically invalid, so mysql_query() fails and returns FALSE:
es: La siguiente sentencia es invalida sintacticamente, asi que mysql_query() falla y devuelve FALSE:

source: Example 1. mysql_query()
es: Ejemplo 1. mysql_query()

source: php $result = mysql_query( "SELECT * WHERE 1=1") or die("Invalid query: ". mysql_error());?
es: ?php $result = mysql_query ("SELECT * WHERE 1=1") or die ("Invalid query");?

source: The following query is semantically invalid if my_col is not a column in the table my_tbl, so mysql_query() fails and returns FALSE:
es: La siguiente sentencia es invalida semanticamente si my_col no es una columna de la tabla my_tbl, asi que mysql_query() falla y devuelve FALSE:

source: Example 2. mysql_query()
es: Ejemplo 2. mysql_query()

source: ?php $result = mysql_query( "SELECT my_col FROM my_tbl") or die("Invalid query: ". mysql_error());?
es: ?php $result = mysql_query ("SELECT my_col FROM my_tbl") or die ("Invalid query");?

source: mysql_query() will also fail and return FALSE if you don't have permission to access the table(s) referenced by the query.
es: mysql_query() fallara tambien y devolvera FALSE si no se tiene el permiso de acceso a la tabla especificada en la sentencia.

source: Only for SELECT,SHOW,DESCRIBE or EXPLAIN statements, mysql_query() returns a new result identifier that you can pass to mysql_fetch_array() and other functions dealing with result tables.
es: Asumiendo la sentencia tenga exito, se puede llamar a mysql_affected_rows() para saber cuantas filas fueron afectadas (para DELETE, INSERT, REPLACE, o UPDATE) Para las sentencias SELECT, mysql_query() devuelve un nuevo identificador de resultado que se puede pasar a mysql_result().

source: Although, the memory will automatically be freed at the end of the script 's execution.
es: Cuando se acabe de utilizar el resultado, se pueden liberar los recursos asociados utilizando mysql_free_result().

source: See also: mysql_num_rows(), mysql_affected_rows(), mysql_unbuffered_query(), mysql_free_result(), mysql_fetch_array(), mysql_fetch_row(), mysql_fetch_assoc(), mysql_result(), mysql_select_db(), and mysql_connect().
es: Ver también: mysql_affected_rows(), mysql_db_query(), mysql_free_result(), mysql_result(), mysql_select_db(), and mysql_connect().

source: Example 1. mysql_real_escape_string() example
es: Ejemplo 1. mysql_real_escape_string() example

source: mysql_result() returns the contents of one cell from a MySQL result set.
es: mysql_result() devuelve el contenido de una celda de un resultado MySQL.

source: The field argument can be the field' s offset, or the field's name, or the field's table dot field name (tablename.fieldname).
es: El campo argumento puede ser el nombre del campo o el offset o tabla.nombre_del_campo.

source: As these functions return the contents of multiple cells in one function call, they' re MUCH quicker than mysql_result().
es: Cuando se trabaja un un gran resultado, debe considerarse la utilizacion de una funcion que devuelva una fila entera ya que estas funciones son MUCHO mas rapidas que mysql_result().

source: Calls to mysql_result() should not be mixed with calls to other functions that deal with the result set.
es: Las llamadas a mysql_result() no deben mezclarse con llamadas a las otras sentencias que trabajan con un identificador de resultado.

source: Recommended high-performance alternatives: mysql_fetch_row(), mysql_fetch_array(), and mysql_fetch_object().
es: Alternativas recomendadas: mysql_fetch_row(), mysql_fetch_array(), y mysql_fetch_object().

source: mysql_select_db() sets the current active database on the server that's associated with the specified link identifier.
es: mysql_select_db() establece la base activa que estara asociada con el identificador de enlace especificado.

source: If no link is open, the function will try to establish a link as if mysql_connect() was called without arguments, and use it.
es: Si no hay ningun enlace abierto, la función intentara establecer un enlace como si se llamara a mysql_connect().

source: Every subsequent call to mysql_query() will be made on the active database.
es: Toda llamada posterior a mysql_query() utilizara la base activada.

source: See also: mysql_connect(), mysql_pconnect(), and mysql_query().
es: Ver también: mysql_connect(), mysql_pconnect(), and mysql_query().

source: Example 1. mysql_stat() example
es: Ejemplo 1. mysql_stat() example

source: mysql_tablename() takes a result pointer returned by the mysql_list_tables() function as well as an integer index and returns the name of a table.
es: mysql_tablename() toma un puntero de resultado devuelto por mysql_list_tables() asi como un indice (integer) y devuelve el nomnre de una tabla.

source: The mysql_num_rows() function may be used to determine the number of tables in the result pointer.
es: Se puede usar la función mysql_num_rows() para determinar el nombre de tablas en el puntero de resultado.

source: Example 1. mysql_tablename() Example
es: Ejemplo 1. mysql_tablename() Example
